class URL:
    # Базовый URL стенда
    base_url = 'https://qa-scooter.praktikum-services.ru'

    # Эндпоинты страниц
    url_main = f"{base_url}/"
    url_order = f"{base_url}/order"

class MainPageFAQ:
   answer_list = {
        0: "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
        1: "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
        2: "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
        3: "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
        4: "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
        5: "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
        6: "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
        7: "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    }

class OrderData:
    data_set = {
        # Заполнены только обязательные поля
        'set_1': {
            'first_name': 'Петр',
            'last_name': 'Петров',
            'address': 'Тестировщика',
            'metro_station': 'Черкизовская',
            'phone': '89995556677',
            'date': '30.11.2026',
            'rental_period': 'сутки',
            'color': None,
            'comment': ''
        },
        # Заполнены все поля
        'set_2':
            {'first_name': 'Александр',
             'last_name': 'Иванованенко',
             'address': 'г. Москва, ул. Ленина, д. 1',
             'metro_station': 'Сокольники',
             'phone': '+79993331122',
             'date': '01.01.2027',
             'rental_period': 'семеро суток',
             'color': 'серая безысходность',
             'comment': 'Хочу красивый самокат',
             },
    }
    